<template>
    <dv-scroll-board :config="config" class="LeftChart1" />
</template>

<script>
export default {
    name: 'LeftChart1',
    data() {
        return {
            config: {
                rowNum: 10,
                align: ['center'],
                header: ['时间', '归属地', '攻击ip'],
                data: [
                    ['2021-01-01', '2.2.3.2', '中国联通'],
                    ['2021-02-01', '2.2.3.2', '中国联通'],
                    ['2021-03-01', '2.2.3.2', '中国联通'],
                    ['2021-04-01', '2.2.3.2', '中国联通'],
                    ['2021-05-01', '2.2.3.2', '中国联通'],
                    ['2021-06-01', '2.2.3.2', '中国联通'],
                    ['2021-07-01', '2.2.3.2', '中国联通'],
                    ['2021-08-01', '2.2.3.2', '中国联通'],
                    ['2021-09-01', '2.2.3.2', '中国联通'],
                    ['2021-10-01', '2.2.3.2', '中国联通'],
                    ['2021-11-01', '2.2.3.2', '中国联通'],
                    ['2021-12-01', '2.2.3.2', '中国联通'],
                    ['2022-01-01', '2.2.3.2', '中国联通'],
                    ['2022-02-01', '2.2.3.2', '中国联通'],
                    ['2020-01-01', '2.2.3.2', '中国联通'],
                    ['2020-02-01', '2.2.3.2', '中国联通'],
                    ['2020-03-01', '2.2.3.2', '中国联通'],
                    ['2020-04-01', '2.2.3.2', '中国联通'],
                    ['2020-05-01', '2.2.3.2', '中国联通'],
                    ['2020-06-01', '2.2.3.2', '中国联通']
                ]
            }
        }
    }
}
</script>

<style lang="scss" scoped>
.LeftChart1 {
    width: 100%;
    height: 80%;
    padding: 5px 2px;
}
</style>